of/org/jbk2/tower_lon_piso1/system/simpleFoam/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
// application     pisoFoam;

startFrom       startTime;
// startFrom       latestTime;

startTime       0;

stopAt          endTime;

// endTime         0.75;
endTime            0.00001;

// deltaT          0.0000025;
deltaT             0.000001;

writeControl    timeStep;

writeInterval   1;
// writeInterval   10;
// writeInterval   1024;

purgeWrite      640;

// writeFormat     ascii;
writeFormat     binary;

writePrecision  6;

writeCompression off;
// writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// functions
// {
    // #includeFunc streamlines
// }

// ************************************************************************* //
